{
  "irVersion": "1.0",
  "project": "omni-telnyx",
  "repository": "https://github.com/plexusone/omni-telnyx",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.3.0",
      "date": "2026-06-13",
      "highlights": [
        { "description": "Full voice gateway for Telnyx Media Streaming with STT→LLM→TTS pipeline" },
        { "description": "MMS and RCS messaging support with OmniChat integration" }
      ],
      "added": [
        { "description": "MMS support with media attachments via `SendMMS`, `SendMMSFrom`, and unified `SendMessage` API", "commit": "4dc06fa" },
        { "description": "RCS support via Telnyx Messaging Profiles with automatic SMS fallback", "commit": "4dc06fa" },
        { "description": "OmniChat provider implementing `provider.Provider` for SMS/MMS/RCS messaging integration", "commit": "4dc06fa" },
        { "description": "Voice gateway implementing `coregateway.Gateway` interface with HTTP/WebSocket server", "commit": "72c63bc" },
        { "description": "Session type implementing `coregateway.Session` interface with metrics tracking", "commit": "72c63bc" },
        { "description": "JSON webhook handlers for Telnyx call events (`call.initiated`, `call.answered`, `call.hangup`)", "commit": "72c63bc" },
        { "description": "WebSocket connection wrapper for Telnyx Media Streaming protocol", "commit": "72c63bc" },
        { "description": "Voice pipeline with STT→LLM→TTS processing chain", "commit": "72c63bc" },
        { "description": "Voice activity detection and silence-based end-of-speech detection", "commit": "72c63bc" },
        { "description": "Barge-in interruption support (immediate, after_sentence, disabled modes)", "commit": "72c63bc" },
        { "description": "Provider factory for STT (Deepgram, OpenAI), LLM (Anthropic, OpenAI), TTS (ElevenLabs, OpenAI, Deepgram)", "commit": "72c63bc" },
        { "description": "LLM tool calling with configurable handlers", "commit": "72c63bc" }
      ],
      "dependencies": [
        { "description": "`github.com/plexusone/omnichat` v0.6.1 (new, for OmniChat provider)", "commit": "01634b6" },
        { "description": "`github.com/plexusone/omnivoice-core` v0.9.0 → v0.11.0 (registry support)", "commit": "581f6e9" },
        { "description": "`github.com/plexusone/omnillm` v0.15.4 (new, for LLM provider)", "commit": "581f6e9" },
        { "description": "`github.com/team-telnyx/telnyx-go/v4` v4.51.0 → v4.78.0", "commit": "4aad6f6" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-05-02",
      "highlights": [
        { "description": "Module rename from omnivoice-telnyx to omni-telnyx with package restructure" }
      ],
      "changed": [
        { "description": "**Breaking**: Module path changed from `github.com/plexusone/omnivoice-telnyx` to `github.com/plexusone/omni-telnyx`", "commit": "fb4b28a" },
        { "description": "**Breaking**: Packages moved to `omnivoice/` subdirectory: `omnivoice/callsystem`, `omnivoice/transport`", "commit": "fb4b28a" }
      ],
      "documentation": [
        { "description": "Update README, CHANGELOG, and release notes for new module name and import paths", "commit": "f6c6f6c" }
      ],
      "tests": [
        { "description": "Conformance tests for callsystem and transport using `omnivoice-core/providertest`", "commit": "60f8ba0" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-03-22",
      "highlights": [
        { "description": "Initial Telnyx provider for OmniVoice with CallSystem, Transport, and SMS support" }
      ],
      "added": [
        { "description": "Telnyx CallSystem provider implementing `callsystem.CallSystem` interface", "commit": "faf962a" },
        { "description": "Telnyx SMSProvider implementing `callsystem.SMSProvider` interface", "commit": "faf962a" },
        { "description": "`MakeCall`, `GetCall`, `ListCalls` for call management", "commit": "faf962a" },
        { "description": "`OnIncomingCall` handler for inbound calls with webhook support", "commit": "faf962a" },
        { "description": "`SendSMS` and `SendSMSFrom` for SMS messaging", "commit": "faf962a" },
        { "description": "Call Control API integration: Answer, Hangup, Speak, PlayAudio", "commit": "faf962a" },
        { "description": "Media Streaming support: `StartMediaStreaming`, `StopMediaStreaming`", "commit": "faf962a" },
        { "description": "Real-time transcription: `StartTranscription`, `StopTranscription`", "commit": "faf962a" },
        { "description": "Telnyx Media Streaming transport implementing `transport.Transport` interface", "commit": "c62b82d" },
        { "description": "Telnyx TelephonyTransport implementing `transport.TelephonyTransport` interface", "commit": "c62b82d" },
        { "description": "WebSocket-based bidirectional audio via `AudioIn()` and `AudioOut()` streams", "commit": "c62b82d" },
        { "description": "DTMF event handling with `OnDTMF` callback", "commit": "c62b82d" },
        { "description": "`SendMark` and `Clear` for audio synchronization", "commit": "c62b82d" }
      ],
      "documentation": [
        { "description": "README with usage examples, architecture diagram, and configuration", "commit": "01dae50" },
        { "description": "v0.1.0 release notes with feature highlights", "commit": "01dae50" }
      ],
      "build": [
        { "description": "MIT LICENSE file", "commit": "d19637d" },
        { "description": "Shared CI workflows for lint, test, and SAST", "commit": "2f1d1e1" }
      ],
      "dependencies": [
        { "description": "`github.com/plexusone/omnivoice-core` v0.6.0", "commit": "603cc31" },
        { "description": "`github.com/team-telnyx/telnyx-go/v4` v4.51.0", "commit": "eb30032" },
        { "description": "`github.com/gorilla/websocket` v1.5.3", "commit": "603cc31" }
      ]
    }
  ]
}
